In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [7]:
df_customers = pd.DataFrame({
    "customer_id": [1, 2, 3, 4],
    "name": ["Adam", "Bob", "charlie", "Dave"]
})

df_orders = pd.DataFrame({
    "order_id": [101, 102, 103, 104],
    "customer_id": [2, 1, 4, 5],
    "amount": [250, 120, 300, 180]
})

pd.merge(df_customers, df_orders, on="customer_id", how="left")
pd.merge(df_customers, df_orders, on="customer_id", how="outer")

   customer_id     name  order_id  amount
0            1     Adam     102.0   120.0
1            2      Bob     101.0   250.0
2            3  charlie       NaN     NaN
3            4     Dave     103.0   300.0
4            5      NaN     104.0   180.0

In [3]:
df_customers

   customer_id     name
0            1     Adam
1            2      Bob
2            3  charlie
3            4     Dave

In [4]:
df_orders

   order_id  customer_id  amount
0       101            2     250
1       102            1     120
2       103            4     300
3       104            5     180

# Concatentation

In [8]:
df1 = pd.DataFrame({
    "id": [1, 2, 3],
    "name" : ["Adam", "Eve", "Bob"]
})

df2 = pd.DataFrame({
    "id": [4, 5, 6],
    "name": ["charlie", "Fester", "Gilian"]
})

In [9]:
df1

   id  name
0   1  Adam
1   2   Eve
2   3   Bob

In [10]:
df2

   id     name
0   4  charlie
1   5   Fester
2   6   Gilian

In [11]:
pd.concat([df1, df2])

   id     name
0   1     Adam
1   2      Eve
2   3      Bob
0   4  charlie
1   5   Fester
2   6   Gilian